{
  "sprint": "README Cleanup and Documentation Improvements",
  "created": "2026-01-22",
  "overview": "Move UI_TESTING.md to templates, remove remaining duplicated content from README, ensure file references include placement instructions, and document the dry run testing feature.",
  "note": "Task IDs are for reference only. Order is determined dynamically.",
  "tasks": [
    {
      "id": "001",
      "name": "Move UI_TESTING.md to templates/",
      "description": "WHY: The templates/ directory contains files that users copy to their projects but that aren't used by the Ralph repo itself. UI_TESTING.md is UI testing guidance for user projects - Ralph has no UI, so this file isn't used here. Moving it to templates/ makes the repo structure clearer: root-level files are used by Ralph development, templates/ contains files purely for copying to other projects.\n\nNote: Other files like ralph-loop.sh, RALPH_PROMPT.md, and PRD templates stay at root because they ARE used for Ralph development. The principle is: if we use it here, keep it at root; if it's only for users to copy, put it in templates/.",
      "acceptanceCriteria": [
        "UI_TESTING.md is in templates/ (not at root)",
        "README references point to the correct location",
        "No broken links in README"
      ],
      "testsPassing": true
    },
    {
      "id": "002",
      "name": "Reset dry run PRD to ready state",
      "description": "WHY: The dry run PRD lets users test their Ralph setup without making real changes. It should be ready to use immediately after copying - if all tasks already show testsPassing: true, running ralph-loop will immediately signal COMPLETE without actually testing anything.\n\nThe dry run PRD was used for testing and now shows completed state. Reset it so new users can actually run through the test cycle.",
      "acceptanceCriteria": [
        "All tasks in prds/999_dry_run_test.json have testsPassing: false",
        "Running ralph-loop on a fresh copy will actually cycle through tasks"
      ],
      "testsPassing": true
    },
    {
      "id": "003",
      "name": "Remove Dockerfile duplication from README",
      "description": "WHY: Duplicated content creates maintenance burden - when the Dockerfile changes, the README copy becomes stale. The README currently embeds the entire Dockerfile via a heredoc block, but the actual Dockerfile exists in the repo. Users should copy from the real file, not from README.\n\nThe goal is: README explains what the Dockerfile does and how to use it, but doesn't duplicate the content. Users copy the actual file. The docker build command and explanation of what the image provides should remain - just not the file contents themselves.\n\nLook for any 'cat > Dockerfile << EOF' or similar heredoc blocks containing Dockerfile content.",
      "acceptanceCriteria": [
        "README does not contain duplicated Dockerfile content",
        "README links to or references the actual Dockerfile",
        "Users can still understand what to do (copy file, run docker build)",
        "Single source of truth for Dockerfile content"
      ],
      "testsPassing": true
    },
    {
      "id": "004",
      "name": "Add placement instructions for referenced files in README",
      "description": "Requires: 001 (UI_TESTING.md location must be finalized first)\n\nWHY: Users copying files from this repo need to know WHERE each file goes. Some files go to ~/ralph-docker/ (machine-level, installed once), some go to each project root, some go to project subdirectories, and some need renaming (e.g., .template suffix removed). Without clear placement instructions, users may put files in wrong locations.\n\nThe goal is: when the README references a file, users should immediately understand:\n1. Where to copy it (machine-level ~/ralph-docker/, project root, project subdirectory)\n2. Whether renaming is needed\n3. Whether it's a one-time setup vs per-project copy\n\nReview all file references in README and ensure this information is clear. The README already has some of this - verify it's complete and consistent. The list of files may have changed, so check what actually exists rather than relying on any hardcoded list.",
      "acceptanceCriteria": [
        "Each file reference in README includes where to place it",
        "Distinction between machine-level and project-level files is clear",
        "Any renaming needed is documented (e.g., .template suffix removal)",
        "A user following the README can correctly place all files"
      ],
      "testsPassing": true
    },
    {
      "id": "005",
      "name": "Add dry run testing instructions to README",
      "description": "Requires: 002 (dry run PRD must be in ready state)\n\nWHY: Users setting up Ralph for the first time want to verify everything works before running real tasks. The dry run PRD (prds/999_dry_run_test.json) provides a safe way to test - Claude only edits the PRD file itself, no git commits or code changes. This catches setup issues (container problems, auth issues, loop mechanics) without risk.\n\nThe goal is: users can easily find and follow instructions to test their setup. They should understand:\n- What the dry run does (tests the loop without real changes)\n- How to run it\n- What success looks like\n- How to reset it for another test run\n\nPlace these instructions where users will find them - likely in the 'Running Ralph' section or nearby. The exact location and format should fit naturally with the existing README structure.",
      "acceptanceCriteria": [
        "README documents how to run a dry run test",
        "README explains that dry run edits only the PRD file, no git commits",
        "Instructions are in a logical place (e.g., Running Ralph section)",
        "README includes how to reset the dry run PRD for reuse"
      ],
      "testsPassing": true
    }
  ]
}
