{
  "sprint": "README Modernization and Workflow Improvements",
  "created": "2026-01-23",
  "overview": "Comprehensive overhaul of the README and supporting infrastructure to fix authentication flow confusion, introduce Claude Code skills for common operations, create an install script, and improve overall documentation clarity and accuracy.",
  "note": "Task IDs are for reference only. Order is determined dynamically based on dependencies.",
  "tasks": [
    {
      "id": "001",
      "name": "Establish Claude Code skills infrastructure",
      "description": "Create the .claude/skills/ directory structure and implement the 'discover' skill for project discovery. This skill should contain the project exploration prompt currently in README Step 3.4, allowing users to simply run '/discover' instead of copy-pasting a long prompt.\n\nKey requirements:\n- Follow Claude Code skills format with SKILL.md frontmatter\n- The skill should instruct Claude to explore the project and populate CLAUDE.md\n- Include appropriate description so it can be auto-invoked or manually triggered\n- Update README Step 3.4 to reference the skill instead of embedding the full prompt\n\nRefer to official Claude Code skills docs: name, description, and markdown instructions in SKILL.md format.",
      "acceptanceCriteria": [
        ".claude/skills/discover/SKILL.md exists with valid frontmatter and instructions",
        "Running /discover triggers project exploration workflow",
        "README Step 3.4 references the skill with brief usage instructions"
      ],
      "testsPassing": false
    },
    {
      "id": "002",
      "name": "Create 'refine' skill for PRD quality checking",
      "description": "Convert the PRD refinement workflow into a Claude Code skill. Currently users must manually reference PRD_REFINE.md—this skill should let them run '/refine prds/XXX.json' to get PRD quality feedback.\n\nKey requirements:\n- Skill accepts a PRD file path as argument\n- Reads the PRD and applies PRD_REFINE.md criteria\n- Outputs formatted feedback (KEEP/SPLIT/MERGE/FIX or 'PRD is ready')\n- Consider whether PRD_REFINE.md should remain as a reference doc or be absorbed into the skill",
      "acceptanceCriteria": [
        ".claude/skills/refine/SKILL.md exists with valid frontmatter",
        "Running /refine <prd-path> triggers PRD quality review",
        "Skill applies task sizing and acceptance criteria checks from PRD_REFINE.md",
        "README updated to show /refine usage in PRD workflow sections"
      ],
      "testsPassing": false
    },
    {
      "id": "003",
      "name": "Create install script for project setup",
      "description": "Create a script that automates the Part 3 project setup process. Users currently must copy many individual files—this should be a single command.\n\nThe script should:\n- Copy all required templates (CLAUDE.md.template→CLAUDE.md, RALPH_PROMPT.md, ralph-loop.sh, ralph-once.sh, progress.txt.template→progress.txt, .claudeignore)\n- Set up .git-hooks/pre-push and configure git to use it\n- Copy prds/ directory with PRD_TEMPLATE.json and PRD_REFINE.md\n- Copy UI_TESTING.md to templates reference location\n- Update .gitignore to exclude ralph-logs/\n- Copy .claude/skills/ directory with discover and refine skills\n- Work for both new projects and existing projects being 'activated' for Ralph\n\nConsider: Should this be a bash script (install.sh) that lives in the Ralph repo root, or a Claude Code skill, or both? A bash script is simpler and doesn't require Claude. The script should be idempotent (safe to run multiple times).\n\nRequires: 001, 002 (skills must exist before the script can copy them)",
      "acceptanceCriteria": [
        "install.sh exists in repo root with clear usage instructions",
        "Running the script from a target project copies all necessary files",
        "Script is idempotent (running twice doesn't break anything)",
        "README Part 3 is dramatically simplified to: clone Ralph repo, run install script, run /discover",
        "Script handles both 'fresh project' and 'existing project' scenarios"
      ],
      "testsPassing": false
    },
    {
      "id": "004",
      "name": "Fix authentication flow and Claude Code installation instructions",
      "description": "The README currently has confusing and incorrect information about authentication:\n\n1. Step 1.2 tells users to install Claude Code on their machine—but it's already in the Dockerfile. Users don't need Claude Code on their host machine for this workflow.\n\n2. Step 1.3 says 'Do this BEFORE setting up Docker. Your auth will be shared with containers automatically.' This is FALSE. Each new container requires its own authentication.\n\n3. gh auth also must be done per-container.\n\nThe README needs to be rewritten so the sequence makes sense:\n- Machine setup: Docker, SSH keys, git identity (things that ARE shared via mounts)\n- Container setup (per-container, each time you create a new one): claude auth, gh auth\n- The workflow should reflect reality: you auth INSIDE the container after starting it\n\nAlso clarify: If someone DOES have Claude Code on their host machine for other purposes, that's separate from this workflow. They should NOT use --dangerously-skip-permissions with their local Claude Code.\n\nThis may require restructuring Parts 1-4 to put auth in the right place (likely Part 4 or Part 7, when you're actually inside the container).",
      "acceptanceCriteria": [
        "Step 1.2 (Install Claude Code) is removed or clearly marked as optional/separate",
        "Step 1.3 is removed or rewritten to NOT claim auth is shared across containers",
        "Per-container auth steps (claude auth, gh auth) appear in the right place (after entering container)",
        "Clear note about --dangerously-skip-permissions if users have local Claude Code",
        "The sequence of instructions reflects actual workflow without backtracking",
        "Part 4.1 no longer references running Claude outside Docker"
      ],
      "testsPassing": false
    },
    {
      "id": "005",
      "name": "Add repository benefits and purpose section",
      "description": "Add a compelling section near the top of the README that explains WHY someone would use the Ralph technique. Currently the README jumps into setup without explaining the value proposition.\n\nKey points to cover:\n- Ralph is a technique/workflow, not a standalone app\n- Docker provides safety: isolated environment, can't accidentally damage host system, can't push to main without human approval\n- Automated feedback loop: Claude iterates until tests pass\n- Incremental progress: one task at a time, each committed, resumable\n- Human oversight: you review and approve PRs, not blind automation\n\nKeep it concise (not verbose). The current 'Key insight' at the end of the README captures some of this—consider moving/expanding that content to the top.\n\nPlace this section after the title but before the time budget or setup instructions.",
      "acceptanceCriteria": [
        "New section exists explaining Ralph's benefits and purpose",
        "Section appears early in README (before setup instructions)",
        "Explains: Docker safety, automated testing loop, human oversight model",
        "Concise—not more than ~15-20 lines",
        "The 'Key insight' content from the end is integrated or moved appropriately"
      ],
      "testsPassing": false
    },
    {
      "id": "006",
      "name": "Replace ASCII directory tree with markdown table",
      "description": "The current 'Repository Structure' section uses an ASCII tree showing every file. This is verbose and hard to maintain.\n\nReplace with a markdown table showing only the IMPORTANT files that users need to understand. Other files can be inferred from the directory descriptions.\n\nSuggested format:\n| File/Directory | Purpose |\n|----------------|----------|\n| Dockerfile | Docker image definition... |\n| ralph-start.sh | Launch container... |\n| templates/ | Files copied to your project |\n| prds/ | PRD templates and examples |\n| .claude/skills/ | Custom Claude Code skills |\n\nThe goal is clarity and scannability, not exhaustive listing. Users can explore the repo themselves for details.",
      "acceptanceCriteria": [
        "ASCII tree is replaced with a markdown table",
        "Table shows ~8-12 key files/directories, not everything",
        "Each entry has a brief, clear purpose description",
        "Directory entries explain what KIND of things live there",
        "Easier to scan and understand than the current tree"
      ],
      "testsPassing": false
    },
    {
      "id": "007",
      "name": "Add markdown table of contents with time estimates",
      "description": "Add a navigation table at the top of the README showing all parts with their time estimates. Currently there's a time budget list, but no linked navigation.\n\nFormat as a markdown table:\n| Part | Description | Time |\n|------|-------------|------|\n| 1 | One-Time Machine Setup | ~30 min |\n| 2 | GitHub Branch Protection | ~10 min |\n| 3 | Project Setup | ~5 min |\n| ... | ... | ... |\n\nIMPORTANT: After all other README changes are complete, revisit the time estimates. The install script should dramatically reduce Part 3 time. Auth changes may affect Part 1 time. Dry run addition may affect Part 7.\n\nThe table should link to each Part heading using markdown anchor links.\n\nRequires: 004, 005, 006, 010, 011 (README structure tasks must be complete for accurate time estimates)",
      "acceptanceCriteria": [
        "Markdown table exists at top of README after benefits section",
        "Each Part is listed with description and time estimate",
        "Part names link to their sections (markdown anchors)",
        "Time estimates reflect the ACTUAL time after all improvements",
        "Replaces the current bullet-list time budget"
      ],
      "testsPassing": false
    },
    {
      "id": "008",
      "name": "Remove new-prd.sh and update PRD creation instructions",
      "description": "The new-prd.sh script is unnecessary—Claude Code is better at creating PRDs from natural language descriptions. Users should simply:\n1. Tell Claude what they want to build\n2. Ask Claude to create a PRD following PRD_TEMPLATE.json\n3. Claude will intuitively follow the numbering pattern from existing PRDs\n\nChanges needed:\n- Delete prds/new-prd.sh from this repo\n- Update README sections that reference new-prd.sh (Parts 4, 5, Quick Reference)\n- Document the natural language PRD creation workflow\n- The /refine skill (task 002) handles quality checking\n\nExample workflow to document:\n```\n'I want to add user authentication with email/password login.\nCreate a PRD following prds/PRD_TEMPLATE.json format.'\n```\n\nClaude will create appropriately numbered PRD with tasks.\n\nRequires: 002 (refine skill should exist for the complete workflow)",
      "acceptanceCriteria": [
        "prds/new-prd.sh is deleted",
        "README documents natural language PRD creation workflow",
        "No remaining references to new-prd.sh in README",
        "Install script (task 003) does NOT copy new-prd.sh",
        "Workflow is simpler: describe feature → Claude creates PRD → /refine → run Ralph"
      ],
      "testsPassing": false
    },
    {
      "id": "009",
      "name": "Enhance progress.txt template with section example",
      "description": "The current progress.txt.template is minimal (just a header). Users and implementers don't know what a proper entry should look like.\n\nAdd an example section showing the expected format for Ralph's entries. This helps users understand what they'll see and helps Claude understand what format to use.\n\nExample content to add:\n```\n---\n[2026-01-23 14:30] PRD: 001_test_infrastructure.json\nTask: 001 - Fix existing test failures\nStatus: COMPLETE\nCommit: abc1234\nNotes: Fixed 3 failing tests in auth.test.ts related to mock setup.\n---\n```\n\nKeep the template realistic but clearly marked as an example.",
      "acceptanceCriteria": [
        "templates/progress.txt.template includes example section format",
        "Example shows: timestamp, PRD reference, task info, status, commit, notes",
        "Example is clearly marked as example/template (not real data)",
        "Format matches what RALPH_PROMPT.md expects Claude to write"
      ],
      "testsPassing": false
    },
    {
      "id": "010",
      "name": "Fix Part 7 (Running Ralph) structure and remove broken instructions",
      "description": "Part 7 has several issues:\n\n1. Dry run test should come BEFORE suggesting users run ralph-loop. Users should verify their setup works before running real iterations. Move the 'Dry Run Test' section earlier.\n\n2. 'Monitor by tailing progress.txt' (`tail -f progress.txt`) doesn't actually work well—remove this instruction.\n\n3. 'If something's wrong, fix your CLAUDE.md or RALPH_PROMPT.md and try again' is vague and unhelpful. Either clarify what kinds of issues are fixed where, or remove it.\n\nRestructure Part 7 flow:\n1. Enter container (ralph-start.sh or ralph-clone.sh)\n2. Verify setup (git status, npm test)\n3. Run dry run test FIRST (prds/999_dry_run_test.json)\n4. If dry run passes, run real PRD\n5. Monitor, stop, exit, resume instructions",
      "acceptanceCriteria": [
        "Dry run section appears BEFORE ralph-loop instructions",
        "No 'tail -f progress.txt' monitoring instruction",
        "'Fix your CLAUDE.md' advice is either clarified with specifics or removed",
        "Part 7 flow is logical: setup → verify → dry run → real run",
        "Users won't waste a real PRD iteration discovering setup issues"
      ],
      "testsPassing": false
    },
    {
      "id": "011",
      "name": "Trim Part 8 (Human Verification) and review Part 5",
      "description": "PRIMARY WORK - Part 8 contains steps that are extraneous for this project:\n\n- Step 8.3 (Run Tests) - Tests already passed inside the container; this is redundant\n- Step 8.4 (Manual Testing) - Optional/assumed; doesn't need explicit instruction\n\nRemove or consolidate these. The human verification part should focus on:\n- Review progress.txt for any blocked tasks\n- Review commits/PR on GitHub\n- Approve and merge\n- Pull changes locally\n\nSECONDARY (minor consistency check, ~5 min): Scan Part 5 (Feature Planning) to ensure it's consistent with the new workflow. Specifically check for: references to new-prd.sh (remove), PRD creation instructions (should mention natural language approach), and /refine skill usage. This is verification, not substantial rework—Part 5's structure stays the same.",
      "acceptanceCriteria": [
        "Part 8.3 and 8.4 are removed or consolidated",
        "Part 8 is focused and not redundant",
        "Part 5 is consistent with new PRD creation workflow (no new-prd.sh references)",
        "Part 5 references /refine skill if appropriate"
      ],
      "testsPassing": false
    },
    {
      "id": "012",
      "name": "Final coherency and sanity review",
      "description": "After all other tasks are complete, do a full pass through the README and related files for:\n\n1. Consistency: Do all cross-references work? Are file paths correct?\n2. Accuracy: Does the documented workflow match reality?\n3. Clarity: Can a new user follow from start to finish without confusion?\n4. Completeness: Are there gaps or missing steps?\n5. Conciseness: Is there unnecessary verbosity that can be trimmed?\n\nSpecific checks:\n- All internal links/anchors work\n- Time estimates in TOC are reasonable\n- No references to deleted files (new-prd.sh)\n- Auth flow is clear and correct\n- Install script is documented properly\n- Skills are documented and referenced correctly\n- Quick Reference section is up to date\n- Commands table is accurate\n\nRequires: All other tasks complete",
      "acceptanceCriteria": [
        "No broken internal links or references",
        "No references to deleted files or old workflows",
        "Time estimates are reasonable for actual workflow",
        "A new user could follow the guide from start to finish",
        "Quick Reference and Commands sections are accurate"
      ],
      "testsPassing": false
    }
  ]
}
