{
  "name": "Investigations",
  "description": "Non-code deliverables that need human review before influencing framework design. All tasks produce documents with findings and recommendations. These can run in parallel — no dependencies between them. Human checkpoint: Review all findings before they shape the framework.",
  "signoff": "full",
  "tasks": [
    {
      "id": "001",
      "description": "Investigation: AGENTS.md pattern — right balance for per-directory knowledge. Per-directory hint files can be powerful or noisy depending on when and what is written. This investigation should determine concrete recommendations for the framework's AGENTS.md convention. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A findings document with concrete recommendations for when and what to write to AGENTS.md files",
      "verification": "Document exists, covers the noise-vs-knowledge tradeoff, includes a concrete recommendation",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "002",
      "description": "Investigation: principle adherence hardening. The design principles are written but there's a risk new sessions won't internalize them strongly enough. This investigation should determine whether principle adherence can be tested or strengthened without becoming prescriptive. Produce findings with specific recommendations. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "Concrete recommendations for ensuring principle adherence — through testing, review checklists, seed improvements, or other means",
      "verification": "Document exists with actionable recommendations. At least one is implementable in a subsequent task.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "003",
      "description": "Investigation: human inbox mechanism. When ralph produces non-code deliverables that need human review, the human needs a clear way to discover what's waiting for them. The current 'needs_human_review' status is necessary but not sufficient. This investigation should design a concrete surfacing mechanism. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A concrete design for how non-code deliverables surface to the human",
      "verification": "Document exists with a recommended approach. Simple enough to implement in one follow-up task.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "004",
      "description": "Investigation: parallelization principles. Ralph can dispatch independent tasks in parallel, but the guardrails for safe parallelization haven't been defined. This investigation should produce guidelines for when parallelization is safe, how conflicts are detected, and when it should be avoided. Should be informed by real execution experience where available. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "Guidelines for when and how to parallelize task execution, with concrete guardrails",
      "verification": "Document exists with actionable guidelines. Covers at least: file conflict detection, shared resource handling, and when NOT to parallelize.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "005",
      "description": "Investigation: how should not-ready tasks be represented? The framework needs a clear convention for tasks that exist but aren't ready for execution. The design should balance clarity of the 'not ready' signal, minimal framework machinery, and human inspectability. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A recommendation for how to represent not-ready tasks, with rationale for the chosen approach",
      "verification": "Document exists with at least 3 options considered and a clear recommendation with tradeoffs.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "006",
      "description": "Investigation: human-blocking and task parking mechanism. When a running task cannot safely proceed without human input, it needs a way to signal this, park the work, and allow other tasks to continue. The design must be filesystem-native (no ralph-specific API), loosely-coupled (a web companion can discover pending questions without knowing ralph internals), and self-contained (the blocking artifact has everything needed to understand and respond). This is DISTINCT from 003/003 (human inbox for completed deliverables) — this is about runtime interruption during execution. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A design for task parking that supports: block signaling, structured 'what I need' artifacts, continuation of parallel work, and eventual web companion integration — all filesystem-native",
      "verification": "Document exists in ralph-context/designs/. Covers: artifact format, filesystem location convention, how ralph knows to skip parked tasks, how a web companion discovers pending questions, how work resumes after human responds. Design is loosely-coupled (no ralph-specific API required for the companion).",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "007",
      "description": "Investigation: preserving architectural intent in task contexts. When a human states WHY something matters — the reasoning and vision behind a requirement — that context is often more valuable than the requirement itself. A future agent can satisfy every listed criterion and still miss the point if the original intent is lost. This investigation should determine how the framework guides preservation of high-signal human reasoning without prescribing a rigid format. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A recommendation for how the framework should guide preservation of architectural intent and original human reasoning in task contexts — through existing mechanisms, new conventions, or role guidance",
      "verification": "Document exists. Audits existing framework files for where this is already addressed (or missed). Proposes at least one concrete integration point. Avoids creating a rigid template (that would defeat the purpose).",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "008",
      "description": "Investigation: naming AND organization audit. The current directory names and structure were chosen quickly — some names are confusing and the organization itself may be wrong. This isn't just 'rename directories' — it's 'is the directory tree the right shape?' The investigation should audit every named directory and concept, question the current nesting and grouping, and propose coherent alternative schemes that cover both names and structure. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A naming and organization options document with 2-3 coherent schemes (covering both names and structure), rationale for each, a recommendation, and a migration impact assessment",
      "verification": "Document exists. Covers every directory in the framework root. Questions the current nesting (not just names). Each proposed scheme is internally consistent (not a mix-and-match). Flags breaking changes honestly. Includes a recommendation.",
      "dependencies": [],
      "status": "pending"
    }
  ]
}
