{
  "name": "Framework Evolution",
  "description": "Build on the validated core loop and investigation findings. Enrich the framework while keeping it composable. Human checkpoint: Has the framework stayed true to its principles? Is it growing in the right direction or becoming what it criticizes?",
  "signoff": "full",
  "tasks": [
    {
      "id": "001",
      "description": "Investigation: propose where accumulated knowledge should integrate into the framework. Generalizable knowledge was captured during founding sessions and is now distributed across task context folders. Some benefits every framework user and belongs in framework/ — but where, and how much? A fresh project installing the framework gets framework/ but NOT ralph-context/, so knowledge that only lives in ralph-context/ doesn't reach new projects. This is a PROPOSAL for the human, not direct integration. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A proposal document mapping each piece of generalizable knowledge to specific framework files, with rationale for what belongs in framework/ vs stays in ralph-context/",
      "verification": "Document exists in ralph-context/designs/. Covers all knowledge sources (design-philosophy, frameworks-research, success-criteria-format, problem-statement-structure, PRD_REFINE.md). Each recommendation includes where and why.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "002",
      "description": "Create standalone design docs for the framework's independent systems. The framework has multiple independent systems that were identified during decomposition, but none have standalone design docs explaining their rationale. Each doc should explain what the system is, why it exists, which principles it embodies, and how it composes with the others. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "6 design docs, each self-contained, each traceable to design principles",
      "verification": "Each under 2 pages. Each references at least one principle. No doc requires another to make sense.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "003",
      "description": "Adapt additional role prompts from open-source frameworks. The framework may benefit from roles not yet defined. Only add roles that address a genuine near-term need — not speculatively. Should incorporate findings from the principle adherence investigation (PRD 003, task 002) if available.",
      "outcome": "1-2 new role prompts or processes that add genuine capability",
      "verification": "Concise (~1 page), follow P2/P8, work standalone, don't duplicate existing roles",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "004",
      "description": "Adapt Docker infrastructure for multi-repo. The current Docker setup assumes one container works with one repo. After this task, multiple projects can be developed in a single container, and the multi-repo setup is documented.",
      "outcome": "ralph-start.sh supports multiple projects. README documents multi-repo setup.",
      "verification": "Start container with two project directories. Both accessible, git works in each.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "005",
      "description": "Design how ralph operates in two modes: PRD auto-execution (the current /ralph skill) and enhanced vibe coding (interactive sessions where the framework's tools and knowledge enhance the human's workflow without orchestrating). The design should keep both modes coherent without adding framework complexity.",
      "outcome": "A design for two-mode operation that doesn't require separate infrastructure for each mode",
      "verification": "Design exists. Both modes use the same framework files. No new framework files required for vibe coding mode.",
      "dependencies": [],
      "status": "draft"
    },
    {
      "id": "006",
      "description": "Write the framework README. This is the front door — the first thing someone reads. It should make the framework understandable to a new developer and show how to adopt parts of it without buying the whole thing. Partial adoption paths matter. Should be informed by the naming/organization audit (003/008) and design docs (004/002) if available, but doesn't block on them. NON-CODE DELIVERABLE — needs human review.",
      "outcome": "A README that a new developer can read and understand: what this is, what the six primitives are, how to adopt all or parts of it",
      "verification": "README exists. Describes all six primitives in plain language. Includes at least 2 partial adoption paths. Does not require reading any other document to make sense. Under 3 pages.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "007",
      "description": "Design and build the install/onboarding process. The current install.sh (PRD 001/002) may be stale relative to the framework structure, and there's no clear onboarding path for a new project. This task is broader than the mechanical install script — it covers the end-to-end experience of a new user setting up the framework, including partial adoption. Should be informed by the naming/organization audit (003/008) for directory names and structure.",
      "outcome": "A working install process that a new user can run to set up the framework in their project, with clear output showing what was created",
      "verification": "Run the install on a fresh directory. Framework structure is created correctly. Output explains what was created and what to do next. Partial install option exists.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "008",
      "description": "Extend WHY.md into a full positioning piece. WHY.md currently serves as a glanceable conversation starter. This task is about building the long-form version: a narrative post that tells the framework's story, suitable for publishing. It should tell a story grounded in real experience, address the 'doesn't Claude Code already do this?' objection, and be accessible to technical PMs and founders, not just engineers. NON-CODE DELIVERABLE — needs human review and heavy human editing (voice matters here).",
      "outcome": "A draft blog post / positioning document that tells the framework's story, suitable for human editing into a publishable piece",
      "verification": "Draft exists. Tells a narrative (not just lists features). Addresses the 'doesn't Claude Code already do this?' objection directly. References real experience, not hypotheticals. Under 10 pages. Could be read by a non-engineer PM and make sense.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "009",
      "description": "Build the qa-engineer role and kickback loop infrastructure. The qa-engineer verifies implementation through testing and can kick back to implementer — replacing opinion-based code review with test-based verification. The kickback mechanism should be a general pattern usable by any role, not a one-off for qa-engineer. Both design-reviewer and qa-engineer kickbacks should use the same underlying pattern.",
      "outcome": "qa-engineer role exists and works. Kickback loops are a documented, general mechanism in the process. design-reviewer→architect and qa-engineer→implementer both use the same pattern.",
      "verification": "qa-engineer perspective exists in framework/perspectives/. processes/prd.md documents kickback rules. ralph.md lists qa-engineer as active. A pipeline with qa-engineer can be planned and executed.",
      "dependencies": [],
      "status": "pending"
    }
  ]
}
