{
  "name": "Framework Evolution",
  "description": "Build on the validated core loop and investigation findings. Enrich the framework while keeping it composable. Human checkpoint: Has the framework stayed true to its principles? Is it growing in the right direction or becoming what it criticizes?",
  "signoff": "full",
  "tasks": [
    {
      "id": "001",
      "description": "Integrate accumulated knowledge into the framework so ALL users benefit. Two sources: (1) prds/PRD_REFINE.md — hard-won insights from 160+ Promptly tasks: implementer trust balance, specification-creativity balance, concrete examples with tentative language, investigation task patterns, acceptance criteria quality. (2) ralph-context/knowledge/ files that contain generalizable guidance: success-criteria-format.md (who/what/how pattern for acceptance criteria), problem-statement-structure.md (discovered/whyItMatters/whatWasTried/constraints), and any other knowledge files that belong in the framework rather than in this project's context. Split appropriately between enhanced roles (spec-reviewer already partially enhanced), new process docs (PRD authoring), and framework templates. The knowledge files in ralph-context/ are working notes — the framework versions should be the canonical home.",
      "outcome": "Generalizable knowledge is in the framework (roles, processes, templates). ralph-context/knowledge/ files that were framework-bound are either absorbed into framework files or moved to framework/. /refine skill references the framework's version of PRD_REFINE.md wisdom.",
      "verification": "/refine skill works. Key insights (implementer trust, tentative language, success criteria format, problem statement structure) are in framework/ files, not only in ralph-context/. A fresh project installing the framework gets this guidance without needing ralph-docker's ralph-context/.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "002",
      "description": "Create the 6 standalone design docs for the framework's independent systems: (1) The Seed, (2) The Knowledge Convention, (3) The PRD Format, (4) The State System, (5) Role Definitions, (6) The Orchestrator Pattern. Each ~1 page in ralph-context/designs/. These explain what, why, which principles, and how each composes with the others.",
      "outcome": "6 design docs, each self-contained, each traceable to design principles",
      "verification": "Each under 2 pages. Each references at least one principle. No doc requires another to make sense.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "003",
      "description": "Adapt additional role prompts from open-source frameworks. Focus on Gas Town (MIT) for engineering quality. See ralph-context/tasks/004-framework-evolution/003/role-adaptation-notes.md. Consider: systematic debugger, investigator role, design review panel process. Only add what we'd actually use soon — not speculatively. Should incorporate findings from the principle adherence investigation (PRD 003, task 002).",
      "outcome": "1-2 new role prompts or processes that add genuine capability",
      "verification": "Concise (~1 page), follow P2/P8, work standalone, don't duplicate existing roles",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "004",
      "description": "Adapt Docker infrastructure for multi-repo. Current ralph-start.sh assumes one container = one repo. See ralph-context/tasks/004-framework-evolution/004/docker-multi-repo.md for design context. Keep it simple. Also document multi-level installation pattern (ralph-docker installed alongside target projects in Docker).",
      "outcome": "ralph-start.sh supports multiple projects. README documents multi-repo setup.",
      "verification": "Start container with two project directories. Both accessible, git works in each.",
      "dependencies": [],
      "status": "pending"
    },
    {
      "id": "005",
      "description": "Design how ralph operates in two modes: (1) PRD auto-execution (the current /ralph skill) and (2) enhanced vibe coding (interactive sessions where ralph's tools and knowledge enhance the human's workflow without orchestrating). See ralph-context/knowledge/two-modes.md for initial thinking. Produce a design that keeps both modes coherent without adding framework complexity.",
      "outcome": "A design for two-mode operation that doesn't require separate infrastructure for each mode",
      "verification": "Design exists. Both modes use the same framework files. No new framework files required for vibe coding mode.",
      "dependencies": [],
      "status": "draft"
    }
  ]
}
