{
  "name": "Bootstrap Cleanup",
  "description": "Complete the bootstrap by cleaning up artifacts from the old framework structure and rewriting existing PRDs to be outcome-only. This is the first PRD the framework executes after bootstrapping — it finishes what the manual bootstrap started. Read ralph-context/tasks/bootstrap/plan.md for the full bootstrap vision and WHY behind these cleanup tasks. Human checkpoint: Are the PRDs ready for the framework to work through?",
  "signoff": "full",
  "tasks": [
    {
      "id": "001",
      "description": "Rewrite PRDs 000-004 to be outcome-only. Currently they are prescriptive — they describe HOW to do things (specific files to create, implementation steps, etc.). The architect phase handles the HOW now. Each PRD should describe WHAT outcome is needed and WHY, with clear verification criteria, but leave implementation approach to the architect. Preserve the human checkpoint structure (PRDs are ordered by complexity). Don't lose valuable context — move implementation hints into ralph-context/tasks/ as durable context if they'd help the architect.",
      "outcome": "PRDs 000-004 describe outcomes and verification only. No implementation prescriptions. Valuable implementation context preserved in task directories.",
      "verification": "Each PRD task has a clear outcome and verification field. No task description contains file paths to create, step-by-step instructions, or implementation details. Durable context directories contain any migrated implementation hints.",
      "dependencies": [],
      "status": "in_progress",
      "pipeline": [
        {"role": "plan", "status": "complete"},
        {"role": "architect", "status": "complete"},
        {"role": "implementer", "status": "pending"},
        {"role": "code-cleaner", "status": "pending"}
      ]
    },
    {
      "id": "002",
      "description": "The bash-loop runner (RALPH_PROMPT.md + ralph-loop.sh) and the subagent runner (/ralph skill) both execute PRD tasks but currently have duplicated, divergent instructions. They should share the same core concepts from ralph.md, with only mode-specific differences separated out.",
      "outcome": "Both execution modes use ralph.md as the single source of truth for how PRD tasks work. Mode-specific concerns (completion signals, tasks-per-invocation) are cleanly separated.",
      "verification": "Both modes work. No duplicated instructions between them. Changing a core concept in ralph.md affects both modes.",
      "dependencies": [],
      "status": "in_progress",
      "pipeline": [
        {"role": "plan", "status": "complete"},
        {"role": "explorer", "status": "complete"},
        {"role": "architect", "status": "pending"},
        {"role": "implementer", "status": "pending"},
        {"role": "code-cleaner", "status": "pending"}
      ]
    },
    {
      "id": "003",
      "description": "Design and build a mature install process for adopting the framework into a new project. The current install.sh is a brittle file-copy script that's out of date. The install experience should be clean, easy for a human to use, and work well in an agentic context. Think about what a developer actually needs when they first adopt this — not just file placement, but understanding what was set up and what to do next.",
      "outcome": "A developer can install the framework into their project with a clear, polished experience. The process works for both humans and agents.",
      "verification": "Run install on a fresh project. Framework is correctly set up. The developer knows what happened and what to do next. The old install.sh is gone.",
      "dependencies": [],
      "status": "in_progress",
      "pipeline": [
        {"role": "plan", "status": "complete"},
        {"role": "explorer", "status": "complete"},
        {"role": "architect", "status": "pending"},
        {"role": "implementer", "status": "pending"},
        {"role": "code-cleaner", "status": "pending"}
      ]
    },
    {
      "id": "004",
      "description": "All documentation in the repo should accurately describe how the framework actually works today. The bootstrap changed a lot — perspectives replaced roles, seed.md got new principles, ralph.md got subagent dispatch and task splitting, the framework/installed boundary was clarified. Audit all docs and fix anything that's stale or misleading.",
      "outcome": "A developer reading the docs gets an accurate picture of the current framework. No stale references to old structures.",
      "verification": "No doc references roles/ as a framework concept. All docs match the actual file structure and capabilities. A new reader wouldn't be confused by outdated information.",
      "dependencies": [],
      "status": "in_progress",
      "pipeline": [
        {"role": "plan", "status": "complete"},
        {"role": "explorer", "status": "pending"},
        {"role": "implementer", "status": "pending"},
        {"role": "code-cleaner", "status": "pending"}
      ]
    },
    {
      "id": "005",
      "description": "The bootstrap replaced framework/roles/ with framework/perspectives/, but the old directory and references to it may still exist. Clean up all remnants of the old role-based structure across the entire codebase.",
      "outcome": "No traces of the old roles/ structure remain. The codebase consistently refers to perspectives.",
      "verification": "The old directory is gone. No references to .ralph/roles/ or framework/roles/ exist anywhere in the codebase (Docker/system roles are fine).",
      "dependencies": [],
      "status": "in_progress",
      "pipeline": [
        {"role": "plan", "status": "complete"},
        {"role": "explorer", "status": "complete"},
        {"role": "implementer", "status": "pending"}
      ]
    }
  ]
}
